//Каждый пункт меню - отдельная команда
//
//// 1. Начать игру
//// 2. Загрузить игру
//// 3. Выйти
//
//Каждый пункт - это команда
//
//Должна быть возможность сохранить игру
//
//Запросить ник игры
//
//В меню "загрузить" - список сохранялок
//
//Command start = new StartCommand("Start game");
//Command end = new StartCommand("Exit");
//
//Menu menu  = new Menu();
//menu.getCommand(1).execute();
//
//Если начать - первый параграф
//Если второй - восстановление
//Если сохранить - сериализация и сохранение
//Если выход - выйти
